# specify a directory to install
cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'crisidev/homebrew-chunkwm'
tap 'koekeishiya/formulae'
tap 'bazelbuild/tap'
tap 'datawire/blackbird'

brew 'awscli'
brew 'bazelbuild/tap/bazel'
brew 'chunkwm'
brew 'coreutils'
brew 'docker'
brew 'erlang'
brew 'exercism'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'git'
brew 'gpg'
brew 'graphviz'
brew 'heroku'
brew 'jq'
brew 'koekeishiya/formulae/skhd'
brew 'neovim'
brew 'nomad'
brew 'packer'
brew 'postgresql'
brew 'ripgrep'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'terraform'
brew 'terraform_landscape'
brew 'tree'
brew 'vim'
brew 'zsh'
brew 'golang'
brew 'docker-compose'
brew 'dep'
brew 'kubectl'
brew 'pulumi'
brew 'stern'
brew 'kubectx'
brew 'datawire/blackbird/telepresence'

# Casks
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'osxfuse'
