# specify a directory to install
cask_args appdir: '/Applications'

tap 'caskroom/cask'

brew 'coreutils'
brew 'erlang'
brew 'exercism'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'git'
brew 'heroku'
brew 'ripgrep'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'tree'
brew 'vim'
brew 'zsh'

# Casks
cask 'dropbox'
cask 'evernote'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'

