# specify a directory to install
cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'crisidev/homebrew-chunkwm'

brew 'chunkwm'
brew 'coreutils'
brew 'erlang'
brew 'exercism'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'git'
brew 'graphviz'
brew 'heroku'
brew 'jq'
brew 'neovim'
brew 'nomad'
brew 'nomad'
brew 'packer'
brew 'packer'
brew 'ripgrep'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'terraform'
brew 'terraform'
brew 'tree'
brew 'vim'
brew 'zsh'

# Casks
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
